{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "microsoft/Florence-2-base-ft",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": "gaussian",
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "qalora_group_size": 16,
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "vision_tower.blocks.3.1.spatial_block.window_attn.fn.qkv",
    "vision_tower.blocks.2.8.spatial_block.window_attn.fn.qkv",
    "v_proj",
    "out_proj",
    "q_proj",
    "vision_tower.blocks.3.0.spatial_block.window_attn.fn.qkv",
    "fc2",
    "vision_tower.blocks.2.7.spatial_block.window_attn.fn.qkv",
    "fc1",
    "k_proj"
  ],
  "target_parameters": null,
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": true
}